---
type: KeynoteEntries
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# KeynoteEntries

`Autodesk.Revit.DB.KeynoteEntries` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | LoadKeynoteEntriesFromFile | 2015 | `public static bool LoadKeynoteEntriesFromFile ( string filePath , KeyBasedTreeEntriesLoadContent keynoteContent )` |